# указываем какие библиотеки будем использовать
import random
import time
import keyboard #работает и на windows и на linux и на mac. нужно установить библиотеку в систему: pip install keyboard

import os
os.system('')  # Магическая строка для включения ANSI в Windows 10+. Без этого не работает print("\033[H")


def draw(car_x, obstacles, score):
    
    # устанавливаем автомобиль в последнюю строку.   
    obstacles[-1][car_x] = "A"

    #собераем все в одну строку
    s = ""                        # пустая строка
    s += "\033[H"                 # перемещает курсор в левый верхний угол,
    s += f"Счёт: {score}\n"       # в верхней строке указываем счет, делаем перенос строки

    # добавляем игровое поле
    for r in range(HEIGHT): # для каждой строки (r - номер строки)
        s += "|"
        for c in range(WIDTH): # для каждого символа в строке (c - номер колонки)
            s += obstacles[r][c] 
        s += "|\n"            # черточка, и перенос строки
     
    # печатаем
    print(s, end="", flush=True) # flush=True - напечатать немедленно, без задержек.



#НАША ПРОГРАММА
# константы:
WIDTH = 9       # ширина игрового поля в символах
HEIGHT= 18      # высота игрового поля в символах
DELAY = 0.12    # время задержки между кадрами, в секундах
# начальные значения:
car_x = WIDTH // 2    # позиция (координата x) машины
obstacles = []      # препятствия. Список списков строк. Будет примерно так: obstacles = [[" ", " "], [" ", " "], [" ", " "]]

#создаем двухмерный массив: список пробелов размером с наше игровое поле  
for i in range(HEIGHT): #номера строк: от 0 до HEIGHT - 1
    row = []
    for j in range(WIDTH): #номера столбцев: от 0 до WIDTH - 1
        row.append(" ")
    obstacles.append(row)
                   
score = 0           # счет

print("\033[2J", end="") # очистить экран

while True:

    # Движение машины
    if keyboard.is_pressed('right'):
        car_x = min(car_x + 1, WIDTH - 1)   # (WIDTH - 1) -это номер крайнего правого символа в нашем игровом поле.
    if keyboard.is_pressed('left'):
        car_x = max(car_x - 1, 0)           # 0 -это номер крайнего левого символа в нашем игровом поле.

    # Перемещаем препятствия вниз 
    for r in range(HEIGHT-1,0,-1): # от 17 до 1
        obstacles[r][:] = obstacles[r-1][:]

    # очищаем верхнюю строку
    for c in range(WIDTH):
        obstacles[0][c] = " "
        
    # Добавляем новое препятствие в верхнюю строку. (строка номер 0)    
    if random.random() < 0.22:      #добавляем не всегда, а в 22% случайных случаев.
        x = random.randrange(WIDTH) # возвращает случайное целое число в диапазоне от 0 до WIDTH-1 включительно.
        obstacles[0][x] = "#"

    # Проверяем столкновение
    if obstacles[HEIGHT - 1][car_x] == "#": # 
        print(f"\n💥 Авария! Итоговый счёт: {score}")
        break
        
    # Рисуем игровое поле
    draw(car_x, obstacles, score)

    score += 1
    time.sleep(DELAY)


#Ctrl + C  - прервать выполнение программы
# Если вошли в интерактивный режим: >>>, то чтобы выйти из него: Ctrl + Z, нажать Enter.
#import sys # для отладки. Где хотим остановить программу, там пишем sys.exit()