# объяснения кода: https://habr.com/ru/companies/yandex_praktikum/articles/1068624/

#ANSI escape-последовательности:
#Терминал умеет принимать не только обычный текст, но и специальные управляющие последовательности.
#С их помощью можно перемещать курсор, очищать экран, менять цвет символов и управлять режимом их отображения.

#Чаще всего в таких командах используются ANSI escape-последовательности.
#Они начинаются с управляющего символа Escape, который в строке Python записывается как "\033".
#После него указывается команда для терминала.

#Примеры:
#print("\033[H") - перемещает курсор в левый верхний угол
#print("\033[2J") - очистить экран
#print("\033[?25l") - скрыть курсор
#print("\033[?25h") - показать курсор


# файл xxx.py - это "модуль", папка c такими файлами - это "пакет". По коду невозможно определить: мы импортируем модуль или пакет. Поэтому все это будем называть "библиотека".
# указываем какие библиотеки будем использовать
import os
import random
import sys
import time
import keyboard #работает и на windows и на linux и на mac. нужно установить библиотеку в систему: pip install keyboard

# константы:
WIDTH = 9       # ширина игрового поля в символах
HEIGHT= 18      # высота игрового поля в символах
SPEED = 0.12    # время задержки между кадрами, в секундах


  


def draw(car, obstacles, score):
    
     #создаем двухмерный массив: список пробелов размером с наше игровое поле   
    rows = []
    for i in range(HEIGHT): # номера строк: от 0 до HEIGHT - 1
        row = [" "] * WIDTH # номера столбцев: от 0 до WIDTH - 1
        rows.append(row)
    
    # заполняем препятствиями
    for x, y in obstacles:
        rows[y][x] = "#"
    
    # устанавливаем автомобиль в последнюю строку.   
    rows[-1][car] = "A"
    
    #делаем из массива символов - строку:
    road=""
    for r in rows:
        road += "|"
        for c in r:
            road += rows[r][c]
        road += "|"
 
    #собераем все в одну строку
    s = (
        "\033[H" +              # перемещает курсор в левый верхний угол,
        f"Счёт: {score}" +      # в верхней строке указываем счет,
        "\n" +                  # делаем перенос строки
        f"{road}"               # прицепляем остальное игровое поле
    )
    print(s, end="", flush=True) # flush=True - напечатать немедленно, без задержек.



#НАША ПРОГРАММА
# начальные значения:
car = WIDTH // 2    # позиция (координата x) машины
obstacles = set()   # препятствия. Функция set() - встроена в Python, создает пустое множество (коллекция уникальных элементов).
                    # Элементами могут быть любые неизменяемые объекты. Мы будем хранить кортежи чисел - координаты припятствий.
                    # Пример: (5, 12) - что означает что в позиции х=5, y=12 находится препятствие. То есть в строке 12, столбце 5.
score = 0           # счет

print("\033[2J", end="") # очистить экран

while True:

    
    # Движение машины
    if keyboard.is_pressed('right'):
        car = min(car + 1, WIDTH - 1)   # (WIDTH - 1) -это номер крайнего правого символа в нашем игровом поле.
    if keyboard.is_pressed('left'):
        car = max(car - 1, 0)           # 0 -это номер крайнего левого символа в нашем игровом поле.

    
    
    # Перемещаем препятствия вниз
    new_obstacles = set()
    
    for x, y in obstacles:
        new_y = y + 1
        if new_y < HEIGHT: # перемещаем до полседней строки. Последняя строка имеет номер (HEIGHT - 1)
            new_obstacles.add((x, new_y))
            
    obstacles = new_obstacles
    

    # Добавляем новое препятствие в верхнюю строку. (координата y = 0)
    if random.random() < 0.22:      #добавляем не всегда, а в 22% случайных случаев.
        x = random.randrange(WIDTH) # возвращает случайное целое число в диапазоне от 0 до WIDTH-1 включительно.
        obstacles.add(x, 0)


    # Рисуем игровое поле
    draw(car, obstacles, score)

    # Проверяем столкновение
    if (car, HEIGHT - 1) in obstacles: # если в позиции автомобиля есть препятствие, то авария. (HEIGHT - 1) -номер последней строки.
        print(f"\nАвария! Итоговый счёт: {score}")
        break

    score += 1
    time.sleep(SPEED)
    #Время сна в секундах.
    #Точность:
    #На Windows точность обычно ~10-15 мс
    #На Linux/macOS точность выше ~1-4 мс
