# объяснения кода: https://habr.com/ru/companies/yandex_praktikum/articles/1068624/

#ANSI escape-последовательности:
#Терминал умеет принимать не только обычный текст, но и специальные управляющие последовательности.
#С их помощью можно перемещать курсор, очищать экран, менять цвет символов и управлять режимом их отображения.

#Чаще всего в таких командах используются ANSI escape-последовательности.
#Они начинаются с управляющего символа Escape, который в строке Python записывается как "\033".
#После него указывается команда для терминала.

#Примеры:
#print("\033[H") - перемещает курсор в левый верхний угол
#print("\033[2J") - очистить экран
#print("\033[?25l") - скрыть курсор
#print("\033[?25h") - показать курсор


# файл xxx.py - это "модуль", папка c такими файлами - это "пакет". По коду невозможно определить: мы импортируем модуль или пакет. Поэтому все это будем называть "библиотека".
# указываем какие библиотеки будем использовать
import os
import random
import sys
import time
import keyboard #работает и на windows и на linux и на mac. нужно установить библиотеку в систему: pip install keyboard


def draw(car_x, obstacles, score):
    
     #создаем двухмерный массив: список пробелов размером с наше игровое поле   
    rows = []
    for i in range(HEIGHT): #номера строк: от 0 до HEIGHT - 1
        row = []
        for j in range(WIDTH): #номера столбцев: от 0 до WIDTH - 1
            row.append(" ")
        rows.append(row)

    # заполняем препятствиями
    for x, y in obstacles:
        rows[y][x] = "#"
    
    # устанавливаем автомобиль в последнюю строку.   
    rows[-1][car_x] = "A"
    

    #собераем все в одну строку
    s = ""                        # пустая строка
    s += "\033[H"                 # перемещает курсор в левый верхний угол,
    s += f"Счёт: {score}\n"       # в верхней строке указываем счет, делаем перенос строки

    # добавляем игровое поле
    for r in range(HEIGHT): # для каждой строки (r - номер строки)
        s += "|"
        for c in range(WIDTH): # для каждого символа в строке (c - номер колонки)
            s += rows[r][c] 
        s += "|\n"            # черточка, и перенос строки
     
    # печатаем
    print(s, end="", flush=True) # flush=True - напечатать немедленно, без задержек.



#НАША ПРОГРАММА
# константы:
WIDTH = 9       # ширина игрового поля в символах
HEIGHT= 18      # высота игрового поля в символах
DELAY = 0.12    # время задержки между кадрами, в секундах
# начальные значения:
car_x = WIDTH // 2    # позиция (координата x) машины
obstacles = []      # препятствия. Список с координатами препятствий. Будет примерно так: obstacles = [[3, 5], [2, 8], [1, 2]]
                    # Пример: [5, 12] - что означает что в позиции х=5, y=12 находится препятствие. То есть в строке 12, столбце 5.
score = 0           # счет

print("\033[2J", end="") # очистить экран

while True:

    
    # Движение машины
    if keyboard.is_pressed('right'):
        car_x = min(car_x + 1, WIDTH - 1)   # (WIDTH - 1) -это номер крайнего правого символа в нашем игровом поле.
    if keyboard.is_pressed('left'):
        car_x = max(car_x - 1, 0)           # 0 -это номер крайнего левого символа в нашем игровом поле.

    
    
    # Перемещаем препятствия вниз (создаем новый список с препятствиями в новой позиции)
    new_obstacles = []
    for obstacle in obstacles: 
        x, y = obstacle        # x, y = [3, 8]   - это называется "распаковка".
        new_y = y + 1
        if new_y < HEIGHT:     # перемещаем до полседней строки. Последняя строка имеет номер (HEIGHT - 1)
            new_obstacle = [x, new_y]
            new_obstacles.append(new_obstacle)
            
    obstacles = new_obstacles
    

    # Добавляем новое препятствие в верхнюю строку. (координата y = 0)
    if random.random() < 0.22:      #добавляем не всегда, а в 22% случайных случаев.
        x = random.randrange(WIDTH) # возвращает случайное целое число в диапазоне от 0 до WIDTH-1 включительно.
        obstacles.append([x, 0])


    # Рисуем игровое поле
    draw(car_x, obstacles, score)

    # Проверяем столкновение
    if [car_x, HEIGHT - 1] in obstacles: # если в позиции автомобиля есть препятствие, то авария. (HEIGHT - 1) -номер последней строки.
        print(f"\nАвария! Итоговый счёт: {score}")
        break

    score += 1
    time.sleep(DELAY)
    #Время сна в секундах.
    #Точность:
    #На Windows точность обычно ~10-15 мс
    #На Linux/macOS точность выше ~1-4 мс


#Ctrl + C  - прервать выполнение программы